app/controllers/api/v1/coupons_controller.rb

SELECT "coupons".* FROM "coupons" WHERE "coupons"."code" = ? LIMIT ?  [["code", "CARNA10"], ["LIMIT", 1]]
---
  def show
    @coupon = Coupon.find_by(code: params[:code])

SELECT "coupons".* FROM "coupons" WHERE "coupons"."code" = ? LIMIT ?  [["code", "TEST20-0001"], ["LIMIT", 1]]
---
  def burn
    @coupon = Coupon.find_by(code: params[:code])