app/controllers/coupons_controller.rb

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def inactivate
    @coupon = Coupon.find(params[:id])

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def activate
    @coupon = Coupon.find(params[:id])