app/controllers/product_categories_controller.rb

SELECT "product_categories".* FROM "product_categories"
---
  def index
    @product_categories = ProductCategory.all

SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def show
    @product_category = ProductCategory.find(params[:id])

INSERT INTO "product_categories" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Socorro"], ["code", "SOCORRO"], ["created_at", "2021-02-25 21:16:36.745360"], ["updated_at", "2021-02-25 21:16:36.745360"]]
INSERT INTO "product_categories" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teste"], ["code", "TEST"], ["created_at", "2021-01-17 21:08:49.562737"], ["updated_at", "2021-01-17 21:08:49.562737"]]
---
  def create
    @product_category = ProductCategory.create(product_categories_params)
    if @product_category.save

SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def edit
    @product_category = ProductCategory.find(params[:id])

SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "product_categories" SET "code" = ?, "updated_at" = ? WHERE "product_categories"."id" = ?  [["code", "SOCORROOO"], ["updated_at", "2021-02-25 21:16:49.939284"], ["id", 12]]
---
  def update
    @product_category = ProductCategory.find(params[:id])

    if @product_category.update(product_categories_params)

SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 12]]
---
  def destroy
    @product_category = ProductCategory.find(params[:id])
    @product_category.destroy