app/controllers/promotions_controller.rb

  def index
    @promotions = Promotion.all
---
SELECT "promotions".* FROM "promotions"

  def show
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search
    if params[:q].blank?
      flash[:notice] = 'Pesquisa em branco'
      redirect_to promotions_path
    else
      @coupons = Coupon.where(code: params[:q])
      @promotions = Promotion.where(name: params[:q])
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."code" = ? LIMIT ?  [["code", "TEST10-0001"], ["LIMIT", 1]]
SELECT "promotions".* FROM "promotions" WHERE "promotions"."name" = ?  [["name", "Teste"]]

  def create
    @promotion = Promotion.create(promotion_params)
    @promotion.user = current_user
    if @promotion.save
---
INSERT INTO "promotions" ("name", "description", "code", "discount_rate", "coupon_quantity", "expiration_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "promotions" SET "description" = ?, "updated_at" = ? WHERE "promotions"."id" = ?  [["description", ""], ["updated_at", "2021-01-17 22:08:20.961174"], ["id", 4]]

  def edit
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @promotion = Promotion.find(params[:id])

    if @promotion.update(promotion_params)
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "promotions" SET "name" = ?, "updated_at" = ? WHERE "promotions"."id" = ?  [["name", "SocorroOO"], ["updated_at", "2021-02-25 21:17:03.987132"], ["id", 4]]

  def destroy
    @promotion = Promotion.find(params[:id])
    @promotion.destroy
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "promotions" WHERE "promotions"."id" = ?  [["id", 4]]

  def approved
    @promotion = Promotion.find(params[:id])
    @promotion.user_approved = current_user
    @promotion.update!(approved_at: DateTime.current)
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "promotions" SET "updated_at" = ?, "approved_at" = ?, "user_approved_id" = ? WHERE "promotions"."id" = ?  [["updated_at", "2021-02-25 21:09:49.745142"], ["approved_at", "2021-02-25 21:09:49.727277"], ["user_approved_id", 2], ["id", 3]]

  def set_promotion
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]