app/views/promotions/_form.html.erb

SELECT "product_categories".* FROM "product_categories"
---
    <%= f.label :product_category_ids, 'Categorias' %>
      <%= f.collection_check_boxes :product_category_ids, ProductCategory.all, :id, :name %>