app/views/promotions/show.html.erb

  <% end %>
  <%if (@promotion.coupons.empty?) && (@promotion.approved?) %>
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."promotion_id" = ?  [["promotion_id", 1]]
SELECT 1 AS one FROM "coupons" WHERE "coupons"."promotion_id" = ? LIMIT ?  [["promotion_id", 1], ["LIMIT", 1]]